cats99/app/controllers/cats_controller.rb

  def create
    cat = Cat.new(cat_params)

    if cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def index
    @cat = Cat.all
---
SELECT "cats".* FROM "cats"

  def destroy
    cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update  #patch
    @cat = Cat.update(params[:id], cat_params)
---
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Carol"], ["description", " This is the third cat "], ["updated_at", "2019-01-30 00:43:47.730937"], ["id", 3]]